Tekla Open API Reference for Tekla Structures 2025
ImageComboBox.ImageCBSelectedIndexChanged Event
 The ImageCBSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler ImageCBSelectedIndexChanged
Public Event ImageCBSelectedIndexChanged As EventHandler
Value
Type: System.EventHandler
See Also
Reference
ImageComboBox Class
Tekla.Structures.Dialog.UIControls Namespace